Revit 2027 API
EnergyDataSettings.BuildingHVACSystem Property
Note: This API is now obsolete.
 The type of HVAC system used by the building for conceptual model energy calculations.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public gbXMLBuildingHVACSystem BuildingHVACSystem { get; set; }
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Property BuildingHVACSystem As gbXMLBuildingHVACSystem
	Get
	Set
public:
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
property gbXMLBuildingHVACSystem BuildingHVACSystem {
	gbXMLBuildingHVACSystem get ();
	void set (gbXMLBuildingHVACSystem value);
}
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
member BuildingHVACSystem : gbXMLBuildingHVACSystem with get, set
Property Value
gbXMLBuildingHVACSystem
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The building HVAC system does not fall within an appropriate range.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace